{
    "footer": {
        "text": "Character Guide • Playstyle: Aloy | Update Date: 08/15/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://gi.yatta.moe/assets/UI/UI_AvatarIcon_Aloy.png"
    },
    "flags": 0,
    "color": 10147839,
    "type": "rich",
    "description": "****On-field DPS****\nAloy’s kit – both combat and passive talents – focuses around her built-in stacking mechanism. When played as the on-field DPS, this “Coil stack” allows for her to increase her normal attack damage. After 4 of these coil stacks are gained, all previous stacks are cleared and she enters the Rushing Ice state, converting all Normal Attacks into Cryo damage. While her Normal Attack string has lacklustre multipliers, it can make up a decent chunk of her damage when played to maximize the duration of her Rushing Ice state and 4th ascension passive. For her to be played as the on-field DPS, an Anemo crowd control character is highly recommended to gain Coil stacks easily. (However, do note there is a 0.1 second cooldown on how fast these stacks can be gained. Venti or the passive of the Viridescent Hunt bow cannot not move the bomblets. Sucrose, Kazuha, Jean or Anemo Traveller is much more recommended)\nThe optimal rotation for a team containing Aloy typically goes as follows:\n> Use Aloy's Elemental Skill (E).\n> Switch to an Anemo character to group the enemies with the bombs.\n> Switch to Aloy for the Coil Stack bonus and to induce Cryo effects to your opponents.\n> Use Aloy’s Elemental Burst (Q).\n**Burst DPS**\nHer Elemental Burst, on the other hand, has a decent scaling 502.88% at Talent Level 6. With an energy cost of 40 and cooldown of 12 seconds, she fits the role of a Burst DPS quite well, being able to Melt for a 1.5x multiplier. When playing as a Burst DPS, it is recommended to build her with enough Energy Recharge to use her Elemental Burst off-cooldown. (Between 140-165%, see the KQM guide linked below for details)\n**Battery Support**\nWhile her Elemental Skill has lacklustre damage, internal cooldown of 0.1 second for stack gaining and high cool down, it has the most particles generated per skill. (being 5, right up there with Xingqiu’s tap skill, Lisa’s hold skill but does have the highest cooldown of the three) She does perform below average when calculating particles generated per second, and provides very minimal additional benefits. However, despite competing for a slot as a Cryo battery (with Kaeya providing decent personal damage, Rosaria with CRIT Rate support and Diona giving healing and shielding), Aloy offers very little utility. However, building her with sacrificial Bow will let her provide 10 Cryo particles in a very short period of time, and let her use her Elemental Burst often to trigger buffs such as Noblesse Oblige set.\n\nOverall as a battery she has the highest upfront Cryo particle generation and an Elemental Burst with a cooldown that matches the Nobless Oblige buff uptime perfectly.",
    "title": "Aloy | Playstyle"
}