{
    "footer": {
        "text": "Character Guide • Playstyle: Electro Traveler | Update Date: 09/27/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/B0zBZMi.png"
    },
    "color": 11104511,
    "type": "rich",
    "description": "**Battery**\nThe role Electro Traveler was most likely designed to fill, the Traveler acts as a somewhat universal battery in Physical, Electro-charged, Overload and Aggravate teams. Off-field electro units tend to bring some form of utility, and the Electro Traveler has a unique ability to give the character that picks up their amulet a portion of their own Energy Recharge.\nRotations vary depending on the team, but generally the Amulets are picked up by energy-hungry characters, such as Eula or Beidou. Do note that if the character the Traveler is paired with is running the Emblem of Severed Fate set, the transferred energy does **NOT** add a damage bonus. It is recommended to change sets if planning on using the Traveler battery.\nTo reach a comfortable level on the Electro Traveler, a R3+ Sacrificial or Favonius Sword is recommended, with at least 50% CRIT Rate for the latter. If running Sacrificial Sword, pick the first round of Amulets with the Traveler, so the Elemental Particles of the second Elemental Skill fills up more of their Elemental Burst.\n**Off-field DPS**\nA little bit of a pity that the Traveler must compete for this role, but can be an option if Fischl, Yae Miko, Kuki Shinobu, Beidou, Raiden Shogun and Lisa are unavailable. (whether Dori is superior is debatable). Their scalings are lacklustre, but with the introduction of Aggravate with Dendro, the Electro Traveler is a little bit more viable built to deal damage off-field. Overload and Hyperbloom are good options too.\nTo play this style, simply press their Elemental Skill, and on the Traveler (or the main DPS needing the energy), pick up the Amulets, raising the Energy Recharge stat. Use their Elemental Burst and any form of Pyro, Hydro + Dendro or Dendro to trigger reactions. If built for Aggravate with Elemental Mastery, CRIT substats must be considered, and a battery of some sort is recommended. \nConsider the Dendro Traveler for Aggravate/Spread. Both can run the 4-piece Deepwood Memories set or full Elemental Mastery for Quicken teams, but Dendro Traveler has less energy issues, wider AOE and benefits from the 2-piece buff. \n*This aims to provide explanation on how to play a certain character, but Electro Traveler in Aggravate/Spread/Hyperbloom teams can be replaced with Dendro Traveler for more comfort. All Traveler forms are free, interchangeable and have their own best slots.*",
    "title": "Traveler | Playstyle"
}