{
    "footer": {
        "text": "Character Guide • Constellations: Raiden Shogun"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/4NdsZHk.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Ominous Inscription (C1)",
            "value": "Chakra Desiderata will gather Resolve even faster. When Electro characters use their Elemental Bursts, the Resolve gained is increased by 80%. When characters of other Elemental Types use their Elemental Bursts, the Resolve gained is increased by 20%."
        },
        {
            "inline": false,
            "name": "Steelbreaker (C2)",
            "value": "While using Musou no Hitotachi and in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, the Raiden Shogun's attacks ignore 60% of opponents's DEF."
        },
        {
            "inline": false,
            "name": "Shinkage Bygones (C3)",
            "value": "Increases the Level of Secret Art: Musou Shinsetsu by 3. Maximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Pledge of Propriety (C4)",
            "value": "When the Musou Isshin state applied by Secret Art: Musou Shinsetsu expires, all nearby party members (excluding the Raiden Shogun) gain 30% bonus ATK for 10s."
        },
        {
            "inline": false,
            "name": "Shogun's Descent (C5)",
            "value": "Increases the Level of Transcendence: Baleful Omen by 3.\nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Wishbearer (C6)",
            "value": "While in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, attacks by the Raiden Shogun that are considered part of her Elemental Burst will decrease all nearby party members' (but not including the Raiden Shogun herself) Elemental Burst CD by 1s when they hit opponents.\nThis effect can trigger once every 1s, and can trigger a total of 5 times during the state's duration."
        }
    ],
    "color": 11104511,
    "type": "rich",
    "title": "Raiden Shogun"
}