{
    "footer": {
        "text": "Character Guide • Constellations: Layla"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Layla.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Fortress of Fantasy (C1)",
            "value": "The Shield Absorption of the Curtain of Slumber generated by Nights of Formal Focus is increased by 20%. \nAdditionally, when unleashing Nights of Formal Focus, she will generate a shield for any nearby party members who are not being protected by a Curtain of Slumber. This shield will have 35% of the absorption of a Curtain of Slumber, will last for 12s, and will absorb Cryo DMG with 250% effectiveness."
        },
        {
            "inline": false,
            "name": "Light's Remit (C2)",
            "value": "When Shooting Stars from Nights of Formal Focus strike opponents, they will each restore 1 Energy to Layla. Each Shooting Star can restore Energy to her in this manner once."
        },
        {
            "inline": false,
            "name": "Secrets of the Night (C3)",
            "value": "Increases the Level of Nights of Formal Focus by 3. \nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Starry Illumination (C4)",
            "value": "When Nights of Formal Focus starts to fire off Shooting Stars, it will grant all nearby party members the Dawn Star effect, causing their Normal and Charged Attack DMG to increase based on 5% of Layla's Max HP. \nDawn Star can last up to 3s and will be removed 0.05s after dealing Normal or Charged Attack DMG."
        },
        {
            "inline": false,
            "name": "Stream of Consciousness (C5)",
            "value": "Increases the Level of Dream of the Star-Stream Shaker by 3. \nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Radiant Soulfire (C6)",
            "value": "Shooting Stars from Nights of Formal Focus deal 40% increased DMG, and Starlight Slugs from Dream of the Star-Stream Shaker deal 40% increased DMG. \nAdditionally, the interval between the creation of Night Stars via Nights of Formal Focus is decreased by 20%."
        }
    ],
    "color": 10147839,
    "type": "rich",
    "title": "Layla | Constellations"
}
