{
    "footer": {
        "text": "Character Guide • Skill Talents: Layla"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Layla.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Sword of the Radiant Path",
            "value": "*Normal Attack*\n> **Normal Attack:** Performs up to 3 rapid strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to unleash 2 rapid sword strikes.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Nights of Formal Focus",
            "value": "*Elemental Skill*\n Puts forth a shield known as the Curtain of Slumber, dealing AoE Cryo DMG. \nThe Curtain of Slumber's DMG Absorption is based on Layla's Max HP and absorbs Cryo DMG with 250% effectiveness. When the shield is deployed, Layla will have Cryo applied to her briefly. \nNight Stars and Shooting Stars \nWhile the Curtain of Slumber is active, it will create 1 Night Star that will be attached to it every 1.5s. When a character protected by this shield uses an Elemental Skill, 2 Night Stars will be created. Night Stars can be created once every 0.3s in this way. A maximum of 4 Night Stars can be accumulated at any one time. \nOnce the Curtain of Slumber has accumulated 4 Night Stars and there are opponents nearby, these Night Stars will transform into homing Shooting Stars that will be fired off in sequence, dealing Cryo DMG to any opponents hit. \nIf the Curtain of Slumber's duration ends or it is destroyed, the Night Stars will disappear. If they are already being fired off as Shooting Stars, these Shooting Stars will last until this wave of shots ends. \nNew Night Stars cannot be created until the previous wave of Shooting Stars has been fired completely."
        },
        {
            "inline": false,
            "name": "Dream of the Star-Stream Shaker",
            "value": "*Elemental Burst*\n Unleashes a Celestial Dreamsphere that constantly fires Starlight Slugs at opponents within its AoE, dealing Cryo DMG. \nWhen a Starlight Slug hits, it will generate 1 Night Star for nearby Curtains of Slumber. Each Curtain of Slumber can gain 1 Night Star this way every 0.5s."
        }
    ],
    "color": 10147839,
    "type": "rich",
    "title": "Layla | Skill Talents"
}
