{
    "footer": {
        "text": "Character Guide • Constellations: Alhaitham"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Alhatham.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Intuition (C1)",
            "value": "When a Projection Attack hits an opponent, Universality: An Elaboration on Form's CD is decreased by 1s. This effect can be triggered once every 1s."
        },
        {
            "inline": false,
            "name": "Debate (C2)",
            "value": "When Alhaitham generates a Chisel-Light Mirror, his Elemental Mastery will be increased by 40 for 8 seconds, max 4 stacks. Each stack's duration is counted independently. This effect can be triggered even when the maximum number of Chisel-Light Mirrors has been reached."
        },
        {
            "inline": false,
            "name": "Negation (C3)",
            "value": "Increases the Level of Universality: An Elaboration on Form by 3.\nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Elucidation (C4)",
            "value": "When Particular Field: Fetters of Phenomena is unleashed, the following effects will become active based on the number of Chisel-Light Mirrors consumed and created this time around:\n•Each Mirror consumed will increase the Elemental Mastery of all other party members by 30 for 15s.\n•Each Mirror generated will grant Alhaitham a 10% Dendro DMG Bonus for 15s.\n\nThe pre-existing duration of the aforementioned effects will be cleared if you use Particular Field: Fetters of Phenomena again while they are in effect."
        },
        {
            "inline": false,
            "name": "Sagacity (C5)",
            "value": "Increases the Level of Particular Field: Fetters of Phenomena by 3.\nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Validity (C6)",
            "value": "If Alhaitham creates another Chisel-Light Mirror when their numbers have already maxed out, then his CRIT Rate and CRIT DMG will increase by 10% and 70% respectively for 6s.\nIf this effect is triggered again during its initial duration, the duration of the buff will increase by 6s."
        }
    ],
    "color": 6794623,
    "type": "rich",
    "title": "Alhaitham | Constellations"
}