{
    "footer": {
        "text": "Character Guide • Playstyle: Klee"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/DsfaSum.png"
    },
    "color": 16733525,
    "type": "rich",
    "description": "**Normal Attack** Klee's Normal and Charged Attack combos have extended animations that leave you vulnerable to enemy attacks. You can avoid this by jumping or dashing to stop the animation and repositioning her to avoid any imminent attacks. This fast animation canceling technique is called ‘Machine Gun’ and it increases your overall DPS by 40 percent on average. You will need to practice the timing on hilichurls if you want to get good at it. You can use one or two Normal Attacks and then a charged attack for best results.\n**Use Jumpty Dumpty Wisely** Klee's Elemental Skill, Jumpty Dumpty, allows her to toss a bouncing bomb that will deal Pyro damage with each bounce. The bomb will break apart into smaller mines at the end of the third bounce and when one of them comes in contact with an enemy, it will explode. Since you start off with two charges on her Elemental Skill, you need to plan your rotations carefully to deal a ton of damage. An ideal combo is to use her Elemental Skill and switch to an Anemo character to pull the mines and enemies for a huge blast.\n**Don't switch after her burst!** Klee's Burst constantly inflicts Pyro and explosive damage to enemies. It's similar to her Charge Attack, except it'll keep hitting the same target until it's eliminated. Her Burst will hit the target enemy irrespective of its height or distance from her. Her Burst can even hit Ruin Hunters and Eye of Storm in the air. An important thing to note is If Klee is switched out during her Elemental Burst, it will be canceled. As a result, you should only change characters once her Elemental Burst is complete. That’s why she is regarded as a selfish DPS, and you will only benefit from her as an on-field damage dealer. \nSource: https://www.thegamer.com/genshin-impact-klee-pro-tips-tricks-guide/",
    "title": "Klee | Playstyle"
}