{
    "footer": {
        "text": "Character Guide • Synergy: Klee"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/DsfaSum.png"
    },
    "color": 16733525,
    "type": "rich",
    "description": "**Pure Pyro** The premise is simple: Viridescent Venerer’s Pyro infused debuff provides a 27.7% damage increase against the typical enemy (who has 10% base resistance). Without having to worry about reactions and controlling aura application, it is extremely simple and easy to keep this debuff on enemies. Coupled with Xiangling’s inconsistent C1 debuff and her small but solid 15% Pyro DMG boost from her C6, team damage is amplified enough to not have to fret about not using amplification reactions. The main drawback is due to going all in with Pyro, it is not as efficient for shield breaking scenarios, which are fairly common in end game content. Kazuha is a tremendous addition to the roster, as not only is he very good at applying VV, but unlike Sucrose’s EM sharing, his team buffs will benefit non-reaction teams with the additional Pyro DMG bonus. He also has additional synergy with Klee and Xiangling as his Skill will draw in mines and Gouba. Another benefit to Kazuha is his respectable damage whilst on the field using Skills and regenerating energy. Xiangling Elemental Burst has a longer cooldown than the others, so the team’s rotations generally extend to around 20-22s to accommodate her. This team is very rotationally flexible and feels smooth to play in both Single Target and AoE content. Rotationally flexible, meaning you can easily delay Xiangling’s burst until needed, add extra Kazuha Skill usage for on demand grouping, or even stay on Klee longer or shorter depending on if juggling is valued or the enemies are already dead. This is in comparison to some other Hypercarry lead teams in the game which can have strict set-ups and set infusion/damage windows.\n    **Reverse Vaporize** It’s worth pointing out at very high levels of investment, importantly with 5* weapons and some 5* Constellations, this team has extremely high Burst damage potential. If content is able to be cleared in one rotation, Mona can wield The Widsith, and you can modify a rotation where Klee sets off initial Jumpy Dumpties for Mona to Vaporise her Burst off of. Her contribution to team damage will be sizable, and with a following onslaught of a highly invested Klee, even end-game chambers can be instantly cleared.\n    **Reverse Melt** In order to use Rosaria most effectively, it is recommended to position her order in the team rotation carefully. Since she is always recommended to combo her Elemental Skill immediately into Burst, she requires either pre-existing 2B Pyro application from Bennett immediately preceding her or ongoing Pyro application via Xiangling’s Burst or Anemo Elemental Absorption. Pay attention when played before an Anemo grouper. For example, when fighting one enemy, going from Bennett EQ > Sucrose E > Rosaria EQ would result in her Burst not Melting on the last hit, as Sucrose will reduce the aura just slightly below the threshold. However this would work if fighting multiple enemies, as Pyro aura swirled off multiple enemies maintains a strong enough foundation (and can even increase with strong swirl application from Venti or Kazuha’s Held Skill). Note, using Venti or Kazuha’s Burst applies constant Pyro anyway, so they will be more universal and easier than using Sucrose.\n    \n    For gearing Rosaria, Favonius Lance and Dragon’s Bane are great options, but her strongest and most flexible pick is Deathmatch. This is mainly down to her Timepiece artifact. An Energy Recharge% main stat artifact is overkill, and therefore between ATK% and EM, (with general substats) ATK% gives weaker returns due to oversaturation from Bennett’s Burst. Therefore Deathmatch with it’s high Crit Value wins due to the best balance. Whilst weaker, using Favonius Lance is equally recommended purely due to otherwise needing 140% ER+ via substats only, making gearing potentially hard. Using it, you can focus on building for all the multiple damage sources. ",
    "title": "Klee | Team Composition and Synergy"
}