{
    "footer": {
        "text": "Character Guide • Skill Talents: Ayato"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/aIcY8dQ.png"
    },
    "description" : "**Kamisato Art - Marobashi**\n*Normal Attack*\n> **Normal Attack:** Perform up to 5 rapid strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to dash forward and perform an iai.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n**Kamisato Art: Kyouka**\n*Elemental Skill*\nKamisato Ayato shifts positions and enters the Takimeguri Kanka state.\nAfter this shift, he will leave a watery illusion at his original location. After it is formed, the watery illusion will explode if opponents are nearby or after its duration ends, dealing AoE Hydro DMG.\nTakimeguri Kanka \nIn this state, Kamisato Ayato uses his Shunsuiken to engage in blindingly fast attacks, causing DMG from his Normal Attacks to be converted into AoE Hydro DMG. This cannot be overridden.\nIt also has the following properties: \n> ·After a Shunsuiken attack hits an opponent, it will grant Ayato the Namisen effect, increasing the DMG dealt by Shunsuiken based on Ayato's current Max HP. The initial maximum number of Namisen stacks is 4, and 1 stack can be gained through Shunsuiken every 0.1s. This effect will be dispelled when Takimeguri Kanka ends.\n> ·Kamisato Ayato's resistance to interruption is increased.\n> ·Unable to use Charged or Plunging Attacks.\nTakimeguri Kanka will be cleared when Ayato leaves the field. Using Kamisato Art: Kyouka again while in the Takimeguri Kanka state will reset and replace the pre-existing state.\n**Kamisato Art: Suiyuu**\n*Elemental Burst*\nUnveils a garden of purity that silences the cacophony within.\nWhile this space exists, Bloomwater Blades will constantly rain down and attack opponents within its AoE, dealing Hydro DMG and increasing the Normal Attack DMG of characters within.",
    "color": 3245055,
    "type": "rich",
    "title": "Ayato | Skill Talents"
}
