{
    "footer": {
        "text": "Character Guide • Skill Talents: Yun Jin"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/nUR6ZQI.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Cloud-Grazing Strike",
            "value": "*Normal Attack*\n> **Normal Attack:** Performs up to 5 consecutive spear strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Opening Flourish",
            "value": "*Elemental Skill*\n> Press\nFlourishes her polearm in a cloud-grasping stance, dealing Geo DMG.\nHold\nTakes up the Opening Flourish stance and charges up, forming a shield. DMG Absorption is based on Yun Jin's Max HP and has 150% effectiveness against all Elemental DMG and Physical DMG. The shield lasts until she finishes unleashing her Elemental Skill. When the skill is released, when its duration ends, or when the shield breaks, Yun Jin will unleash the charged energy as an attack, dealing Geo DMG. Based on the time spent charging, it will either unleash an attack at Charge Level 1 or Level 2."
        },
        {
            "inline": false,
            "name": "Cliffbreaker's Banner'",
            "value": "*Elemental Burst*\n> Deals AoE Geo DMG and grants all nearby party members a Flying Cloud Flag Formation.\nFlying Cloud Flag Formation\nWhen Normal Attack DMG is dealt to opponents, Bonus DMG will be dealt based on Yun Jin's current DEF. The effects of this skill will be cleared after a set duration or after being triggered a specific number of times. When one Normal Attack hits multiple opponents, the effect is triggered multiple times according to the number of opponents hit. The number of times that the effect is triggered is counted independently for each member of the party with Flying Cloud Flag Formation."
        }
    ],
    "color": 14994176,
    "type": "rich",
    "title": "Yun Jin | Skill Talents"
}