{
    "footer": {
        "text": "Character Guide • Playstyle: Sayu | Update Date: 11/12/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://gi.yatta.moe/assets/UI/UI_AvatarIcon_Sayu.png"
    },
    "flags": 0,
    "color": 5494962,
    "type": "rich",
    "description": "**Support**\nSayu’s Elemental Skill and Elemental Burst are both able to provide party-wide and active character healing. Sayu’s Elemental Skill hits multiple times, and with her first ascension passive will heal the whole party when it triggers a Swirl reaction. You can pick if you want to play her as an on-field healer, building her with full Elemental Mastery, or off-field Burst healer, building Energy Recharge and Attack. Having her 6th Constellation can make it better to build Elemental Mastery. \n\nOn-field: Apply an element to the enemy, hold Elemental Skill and trigger as many Swirls as possible. \n*You should still aim to pull off her kick at the end, even if it means ending her roll early*\n\nOff-field: Short Held Elemental Skill into Burst, (Only add Normal Attacks if Favonius Greatsword did not proc, or if Wolf’s Gravestone buff was not triggered yet)\n\n*If looking to burst semi-consistently, it is recommended to hold for at least a slight moment before letting go of her Elemental Skill, as it generates more energy for a very short cd increase.* \n\nSayu’s other supportive capabilities come from her weapon, such as Favonius Greatsword for energy, Viridescent Venerer or Noblesse Oblige. Ocean-hued Clam can work, but after the initial Elemental Burst cast, the full bubble damage will be difficult to reach, but still provides a not-insignificant amount of off-field damage.\nFinally, in Dendro-based teams where healing is required, (due to Bloom-based reactions often damaging the player as well), she can be slotted in to hold the Deepwood Memories set.\n\n**Reaction Driver/Main DPS**\nBoth focus almost entirely on her roll and kick in her Elemental Skill, with her building either full Elemental Mastery for reactions or building a mix of Anemo DMG Bonus, CRIT Rate, CRIT DMG and Elemental Mastery. Both focus on shielding her (or dodging very well with her roll) and applying as many buffs as possible for her roll and final kick.\nFor Elemental Mastery Reaction Driver build, do make sure there are either elemental enemies or off-field appliers such as Fischl, and be wary of self-Overloads.\nSayu is able to swirl more than one element at once, such as in the case of Electro-Charged teams, but only able to infuse one element per roll. \nFor Dendro-based reactions, rolling with Electro infusion, max Elemental Mastery and off-field Dendro is a recommended for max damage from Sayu. \n*Note that Talents requiring Normal Attacks such as Beidou or Xingqiu’s bursts will not trigger with Sayu’s roll and will have their duration wasted.*",
    "title": "Sayu | Playstyle"
}