{
    "footer": {
        "text": "Character Guide • Playstyle: Chongyun | Update Date: 08/24/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/FA8SPoN.png"
    },
    "color": 10147839,
    "type": "rich",
    "description": "**Burst DPS Chongyun**\nDespite being called Burst DPS, Chongyun doesn’t actually contribute the most in his teams. While his Elemental Burst can contribute a sizable chunk of damage, it does not merit building for it when considering overall team DPS. Due to this his most recommended set will be Noblesse Oblige, where the set bonus does increase his personal damage slightly. He is a Burst DPS but mainly a melt enabler for Bennett. Bennett casts his burst, creating a Pyro aura to Melt Chongyun’s burst off, then Chongyun’s skill is placed to infuse Bennett’s Normal Attacks with Cryo. Bennett’s passive lowers the cooldown of his skill while inside of his own Elemental Burst, and he uses his skill to Melt each one from the Cryo applied by his infused Normal Attacks.\nNoblesse Oblige and the Wolf’s gravestone passive work together to buff the on-field DPS’s Attack. This is his best support build, but only loses out slightly to a fully damage focused build. For the sake of team DPS, his personal damage is put second. If the artifact set is already on another character, or if the claymore is needed for another DPS, Sacrificial Greatsword with the Emblem of Severed Fate set work with minimal DPS loss.\nChongyun’s main teams are melt and shatter, where Bennett and Xingqiu are the main DPS respectively. For detailed information and rotations, the KQM guide linked is suggested.\n**Support Chongyun**\nChongyun’s 4th ascension passive is triggered at the end of his skill but can be prematurely triggered with the Sacrificial Greatsword. The additional energy generated and the Energy Recharge substat can be utilized to trigger the Noblesse Oblige set more reliably. Otherwise, the Instructor set is relatively easy to trigger in his teams. Tenacity of the Millieth would work smoothly in his rotations but does near nothing for his personal damage and is not recommended.\n**Additional Notes on Chongyun**\nChongyun’s best role is an enabler and support. He allows for units to apply Cryo with their Normal Attacks, and outside of meme-ish teams such as Cryo Beidou or Cryo Zhongli, can be used to reliably melt skills and bursts. In Shatter teams where a Hydro main DPS is utilized, the damage does not come from Chongyun’s kit directly. His teams are always a little bit unique, but enough to clear the hardest content in the game.\n*Go OG National Team~*",
    "title": "Chongyun | Playstyle"
}