{
    "footer": {
        "text": "Character Guide • Skill Talents: Zhongli"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/fqg3O0z.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Rain of Stone",
            "value": "*Normal Attack*\n> **Normal Attack:** Performs up to 6 consecutive spear strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to lunge forward, dealing damage to enemies along the way.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging enemies along the path and dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Dominus Lapidis",
            "value": "*Elemental Skill*\nPress\nCommands the omnipresent power of earth to solidify into a Stone Stele, dealing AoE Geo DMG.\nAdditionally, the Stone Stele will resonate with other Geo Constructs in the vicinity, dealing Geo DMG to surrounding enemies.\nThe Stone Stele is considered a Geo Construct, and can both be climbed and used to block attacks. Only one may exist at any one time.\nHold\nCauses nearby Geo energy to explode, causing the following effects:\n\nCreates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP, and absorbs Geo DMG 250% more effectively.\nCauses AoE Geo DMG.\nIf there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG.\n\nStone Stele\nWhen created, deals AoE Geo DMG.\nAdditionally, it will intermittently resonate with other nearby Geo constructs, dealing Geo DMG to nearby opponents.\nThe Stone Stele is considered a Geo construct that can both be climbed and used to block attacks.\nOnly one Stele created by Zhongli himself may initially exist at any one time.\n\nJade Shield\nPossesses 150% DMG Absorption against all Elemental and Physical DMG.\nCharacters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked."
        },
        {
            "inline": false,
            "name": "Planet Befall",
            "value": "*Elemental Burst*\nBrings a falling meteor down to earth, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them.\nPetrification\nOpponents affected by the Petrification status cannot move."
        }
    ],
    "color": 14994176,
    "type": "rich",
    "title": "Zhongli | Skill Talents"
}