{
    "footer": {
        "text": "Character Guide • Skill Talents: Yoimiya"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/D5tXbxb.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Firework Flare-Up",
            "value": "*Normal Attack*\n> Normal Attack:\nPerforms up to 5 consecutive shots with a bow.\nCharged Attack:\nPerform a more precise Aimed Shot with increased DMG. While aiming, flames will accumulate on the arrowhead before being fired off as an attack. Has different effects based on how long the energy has been charged:\n**Charge Level 1**: Fires off a flaming arrow that deals Pyro DMG.\n**Charge Level 2**: Generates a maximum of 3 Kindling Arrows based on time spent charging, releasing them as part of this Aimed Shot. Kindling Arrows will home in on nearby opponents, dealing Pyro DMG on hit.\nPlunging Attack:\nFires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Niwabi Fire-Dance",
            "value": "*Elemental Skill*\nYoimiya waves a sparkler and causes a ring of saltpeter to surround her.\nNiwabi Enshou: During this time, arrows fired by Yoimiya's Normal Attack will be Blazing Arrows, and their DMG will be increased and converted to Pyro DMG. during this time, Firework Flare-Up will not generate Kindling Arrows at **Charge Level 2**.\nThis effect will deactivate when Yoimiya leaves the field."
        },
        {
            "inline": false,
            "name": "Ryuukin Saxifrage",
            "value": "*Elemental Burst*\nYoimiya leaps into the air along with her original creation, the \"Ryuukin Saxifrage,\" and fires forth blazing rockets bursting with surprises that deal AoE Pyro DMG and mark one of the hit opponents with Aurous Blaze.\nAurous Blaze: All Normal/Charged/Plunging Attacks, Elemental Skills, and Elemental Bursts by any party member other than Yoimiya that hit an opponent marked by Aurous Blaze will trigger an explosion, dealing AoE Pyro DMG.\nWhen an opponent affected by Aurous Blaze is defeated before its duration expires, the effect will pass on to another nearby opponent, who will inherit the remaining duration.\nOne Aurous Blaze explosion can be triggered every 2s. When Yoimiya is down, Aurous Blaze effects created through her skills will be deactivated."
        }
    ],
    "color": 16733525,
    "type": "rich",
    "title": "Yoimiya | Skill Talents"
}