{
    "footer": {
        "text": "Character Guide • Build: Shikanoin Heizou | Update Date: 08/14/2022 | Editor: Luno#1337"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/ZrsI0Bj.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Skyward Atlas (DPS)__ \nSkyward Atlas is Heizou’s general Best-in-Slot weapon for his personal damage owing to the large attack stats it supplies. \n\n__Sacrificial Fragments R3+ (DPS)__ \nThe additional skill charge, coupled with the additional swirls instances, composes a potent weapon that is comparable to other 5 star catalyst options — even when the added skill is left unstacked.\n\n__Widsith (DPS)__\nSince each buff the weapon passive provides works well on Heizou, Widsith — at high refinements — has the ability to be on-par with his 5 star options. However, owing to the 30s buff trigger cooldown, 5 star options still pull ahead when the note buffs are averaged. \n\n__Thrilling Tales of Dragon Slayers (Support)__\nSince the weapon passive limits the flexibility of rotations in order to utlise its strong single-character buff, players are encouraged to run this weapon only when playing an already rotation-strict team. \n** **"
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__Mappa Mare (DPS)__ \nA strong F2P weapon that is very competitive with the other 4 star options, in addition to having an easy to maintain weapon passive. For those without the liberty of catalyst options, using a billet to craft the Mappa Mare for Heizou is a solid course of action.  \n\n\n__Solar Pearl (DPS)__\nA decent weapon with a passive that, as a whole, works well with Heizou’s kit. However, it is not advisable to purchase the battle pass purely for the crit mainstat because Mappa Mare, at high refines, performs similarly while being a F2P option. \n\n__Prototype Amber (Support)__ \nPrototype Amber has a unique passive that aids healer-less teams with micro-heals in addition to managing his ER requirements when Heizou can only manage to use one skill per burst. The value of the energy refund weapon passive greatly depends on if the player has his C4, which would provides a large reduction to his ER requirements.\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-viridescentvenerer"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands> ATK% |<goblet> Anemo DMG bonus |<circlet>  CRIT Rate or DMG"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "CRIT Rate|CRIT DMG|ATK%|Energy Recharge        "
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Skill: Heartstopper Strike\n**2)**Elemental Burst: Windmuster Kick \n**3)**Normal Attack:  Fudou Style Martial Arts\n** **"
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "ER requirements can vary majorly depending on the context of the team Heizou is used in. Generally, Heizou is most commonly found performimg 2 fully-stacked skill uses each rotation. In this scenario, a range of 110-120% ER should be enough to burst every rotation. \nFor more specific situations, be sure to check out the Energy Recharge Calculator tool.\n\n4 Viridescent Venerer is the best artifact set by far for Heizou. In teams that already have an anemo running the 4-piece set or monogeo/ anemo team compositions, running 2-piece set combinations on Heizou is an option. "
        }
    ],
    "color": 5494962,
    "type": "rich",
    "title": "Heizou (Quickswap DPS/Support) | Build"
}