{
    "footer": {
        "text": "Character Guide • Build: Shikanoin Heizou | Update Date: 08/06/2022 | Editor: Luno#1337"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/ZrsI0Bj.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Hakushin Ring__ \nA potent weapon option that shines best in electrocharge teams as it can buff both electro, and hydro party members. Given its strong multi character buff, coupled with a much less rotation restrictive trigger condition, makes this weapon an excellent choice for Heizou in monoelectro and electrocharge team compositions. \n\n__Sacrificial Fragments__\nAlthough not a weapon to support party members, the boost in personal damage in addition to an additional charge of his E will usually compensate for the lack of buffs; particularly when Heizou is used as an on field em carry.\n\n__Thrilling Tales of Dragon Slayers__\nLow investment option with a strong buff, albeit only for one team member. Rotations are very restricted when running this weapon to optimally buff the main damage dealer on the team, so only use the weapon when running strict rotations."
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__Prototype Amber__ \nFor teams without healers, Prototype Amber can be a viable option with its small yet significant heals. At R5, the weapon drops his ER requirements by ~80%, enabling Heizou to Burst twice per rotation instead of once for some extra personal damage and additional CC, or to mend his ER needs in teams where Heizou can only feasibly get off 1 skill per burst. \n\n__Favonius Codex__ \nWhen using Heizou in low particle teams, Favonius Codex is a great option to aid his teammates er requirements, particularly when given the opportunity to proc the passive multiple times theoughout the rotation. However, players must be able to afford the crit rate substats necessary in order to proc the passive consistently each rotation. \n"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-viridescentvenerer"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands>  Elemental Mastery | <goblet> Elemental Mastery | <circlet>  Elemental Mastery"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "CRIT Rate ( when running Favonius Codex )|Elemental Mastery|Energy Recharge"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Skill: Heartstopper Strike\n**2)** Normal Attack:  Fudou Style Martial Arts\n**3)** Elemental Burst: Windmuster Kick"
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "4 Viridescent is the best set on Heizou by far, both for his personal damage and his buffing capabilities. Only consider the other artifact sets when using a team that does not enable Heizou to consistently swirl, and if the team does not need VV user. ( mono anemo/ geo, secondary VV holder already in team, etc )\n\nfor mono anemo/ geo element teams, running a crit build would be much preferred for his personal damage. "
        }
    ],
    "color": 5494962,
    "type": "rich",
    "title": "Heizou (Burst/Support) | Build"
}