{
    "footer": {
        "text": "Character Guide • Skill Talents: Kaveh"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Kaveh.png"
    },
    "color": 6794623,
    "type": "rich",
    "description": "**Normal Attack: Schematic Setup**\n*Normal Attack*\n> **Normal Attack:** Uses Mehrak to perform up to 4 consecutive attacks.  \n> **Charged Attack:** Drains Stamina over time to perform continuous slashes. At the end of the sequence, performs a more powerful slash.  \n> **Plunging Attack:** Plunges from mid-air to strike the ground, damaging opponents along the path and dealing AoE DMG upon impact.\n**Artistic Ingenuity**\n*Elemental Skill*\nUses Mehrak's mapping ability for offensive purposes, initiating a radial scan that deals AoE Dendro DMG. It will also scan all Dendro Cores in its AoE and cause them to immediately burst.\n\nMehrak was created through the modification of ancient technology and may have some other functions apart from mapping work...\n**Painted Dome**\n*Elemental Burst*\nCompletely unleashes Mehrak's energy and creates a cubic scanned space, dealing AoE Dendro DMG to all opponents within it, causing all Dendro Cores in its AoE to immediately burst, and granting Kaveh the following enhanced combat abilities for a specific duration:\n<:blurplejoinarrow:932413900073369621> Increases Kaveh's Normal, Charged, and Plunging Attack AoE, and converts his attack DMG to Dendro DMG that cannot be overridden.\n<:blurplejoinarrow:932413900073369621> All Dendro Cores created by all your own party members through Bloom reactions will deal additional DMG when they burst.\n<:blurplejoinarrow:932413900073369621> Increases Kaveh's resistance to interruption.\nThese effects will be canceled once Kaveh leaves the field.\n\n\"Every building style includes the architect's unique worldview, and from this angle, one can say that the buildings themselves are coalescences of human memories.\"\n",
    "title": "Kaveh | Skill Talents"
}