{
    "footer": {
        "text": "Character Guide • Skill Talents: Kaedehara Kazuha"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/Jru7MPN.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "> Garyuu Bladework",
            "value": "Normal Attack\nPerform up to 5 rapid strikes.\nCharged Attack\nConsumes a certain amount of Stamina to unleash 2 rapid sword strikes.\nPlunging Attack\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact. If this Plunging Attack is triggered by Chihayaburu, it will be converted to Plunging Attack: Midare Ranzan.\nPlunging Attack: Midare Ranzan\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG and will create a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents.\n*Normal Attack*"
        },
        {
            "inline": false,
            "name": "> Chihayaburu",
            "value": "Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing Anemo DMG and lifting Kazuha into the air on a rushing gust of wind.\nPress\nCan be used in mid-air.\nHold\nCharges up before unleashing greater Anemo DMG over a larger AoE than Press Mode.\nPlunging Attack: Midare Ranzan\nWithin 10s of remaining airborne after casting Chihayaburu, Kazuha can unleash a powerful Plunging Attack known as Midare Ranzan.\nWhen a Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG. On landing, Kazuha creates a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents. Midare Ranzan's DMG is considered Plunging Attack DMG.\n*Elemental Skill*"
        },
        {
            "inline": false,
            "name": "> Kazuha Slash",
            "value": "The signature technique of Kazuha's self-styled bladework — a single slash that strikes with the force of the first winds of autumn, dealing AoE Anemo DMG. The blade's passage will leave behind a field named \"Autumn Whirlwind\" that periodically deals AoE Anemo DMG to opponents within its range.\nElemental Absorption: If Autumn Whirlwind comes into contact with Hydro/Pyro/Cryo/Electro, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use.\n*Elemental Burst*"
        }
    ],
    "color": 5494962,
    "type": "rich",
    "title": "Kaedehara Kazuha | Skill Talents"
}