{
    "footer": {
        "text": "Character Guide • Build: Fischl | Update Date: 08/28/2022 | Editor: Pile6Zero#6228"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/78124Xb.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Skyward Harp, Thundering Pulse, Polar Star, Aqua Simulacra__ \nFischl’s 5 star weapon options are generally within similar margins to one another. Skyward Harp, Thundering Pulse, and Aqua Simulacra provide consistent damage while Polar Star has a conditional passives that, when maintained, pulls ahead over her other weapon options. \n** **"
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__The Stringless, Alley Hunter__ \nPowerful gacha 4-star weapons that are competitive with her 5* options. Alley Hunter usually performs a bit better than Stringless due to it's higher base atk and more useful substat\n\n__Elegy of the End__ \nThe team buff provided by Elegy can outweight the loss of Fischl's personal damage in certain reaction dependent teams(often vaporize teams)\n\n__Prototype Crescent__ \nThis weapon performs well but requires complicated rotations to trigger and snapshot it's passive, generally not recommended\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "2-piece combinations of +18% ATK work fine on Fischl. However, in numerous cases, the quality of the substats takes a much higher priority compared to forcing the set bonus’. "
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands> ATK% |<goblet>  Electro DMG Bonus |<circlet>  CRIT Rate / CRIT DMG"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "Energy Recharge ( see notes ) |CRIT Rate|CRIT DMG|ATK%"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Skill: Nightrider\n**2)** Elemental Burst: Midnight Phantasmagoria\n\nNormal attacks are irrelevant to upgrade in this playstyle.  "
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "Fischl’s ER requirements varies wildly depending on the scenario she is used in. Thus, it is best to check with the Energy Recharge Calculator to find out her ER requirements in player’s specific team compositions.\n\n**Niche Artifact sets:**\n__4 Thundersoother__\nStrong option when playing Fischl in most team compositions where electro aura is maintained. However, the damage gained is not worth farming this 4-pc set over 2-piece options.\n\n__4 TotM__ \nAn artifact set that may be useful in certain teams as Fischl can maintain almost 100% uptime of the 4-set. However this set lowers her personal damage, and since the domain that drops the set is not useful to most characters, it is not recommended to farm this set."
        }
    ],
    "color": 11104511,
    "type": "rich",
    "title": "Fischl (Off-Field DPS) | Build"
}