{
    "footer": {
        "text": "Character Guide • Build: Kaedehara Kazuha | Update Date: 11/22/2022 | Editor: hatter#6666"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/Jru7MPN.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Freedom-Sworn__\nKazuha’s signature weapon which is also the best weapon in terms of both his personal damage, and his support capabilities.\n\n__Favonius Sword__\nProvides extreme comfort with an ER mainstat, as well as a passive that aids in further reducing his ER requirements, alongside his team’s. When using this weapon, crit rate substats are a high priority in order to proc the passive more consistently.\n** **"
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__Iron Sting__\nBest option 4 star option for kazuha’s personal damage when Kazuha and a strong buffing weapon when he does not require much ER and/ or he can get enough ER from substats while running EM/EM/EM.\n\n__Dark Iron Sword__\nProvides slightly less EM than Iron Sting but is still a very competitive option — especially for players who do not have the billets or want to save the billets to craft a different weapon, namely Amenoma Kageuchi, instead.\n\n__Sacrificial Sword__\nAn ER stat stick which allows for chaining multiple skill uses in one window. However, using the additional skill cast runs into the same issue as his C1; taking more field time that orherwise could have been better utilised by the team’s On-Field DPS units.\nSince Kazuha only deals one elemental skill damage instance, the weapon passive would be very unreliable to proc at lower refinements, with higher refinements aiding but still proc’ing the passive inconsistently.\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-viridescentvenerer"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands> Elemental Mastery OR Energy Recharge |<goblet>  Elemental Mastery |<circlet>  Elemental Mastery"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "Energy Recharge|Elemental Mastery|Crit Rate (when using Favonius Sword)|ATK% (without Bennett/ATK Buffs)|CRIT (with Bennett/ATK Buffs)"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Burst: Kazuha Slash\n**2)** Normal Attack: Garyuu Bladework\n**3)** Elemental Skill: Chihayaburu"
        }
    ],
    "color": 5494962,
    "type": "rich",
    "title": "Kazuha (Off-Field DPS) | Build"
}