{
    "footer": {
        "text": "Character Guide • Playstyle: Xinyan | Update Date: 08/15/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/T6meiSo.png"
    },
    "color": 16733525,
    "type": "rich",
    "description": "XINYAN\n**Main DPS**\nXinyan’s damage comes from a mix of her normal attacks and the Physical damaging swing from her Elemental Burst. Her shield adds interruption resistance and additional Physical damage increase from her 4th ascension passive.\n Xinyan as a Main DPS benefits less from Defence and rather prefers Attack stats after CRIT Rate and CRIT Damage. However, with the introduction of the Redhorn Stonethresher, her split scaling problem is mitigated but not removed. Gaining her C6 will however prefer her building Defence for Normal and Charged Attacks, but forgoing Attack will remove damage from her Elemental Burst. It is up to the player to decide if they prefer a Defence and Pyro damage focus or Attack and generalized Physical damage focused playstyle. For most Main DPS Xinyan, the primary focus will end up being Physical Damage from her Charged Attacks and Elemental Burst. Due to this, she is recommended to build minimum of 130% Energy Recharge. Being a character that has been in the game for a while, it is unlikely Hoyoverse will buff her and change her scalings to let the players build only Attack or only Defence. \nQuite a large number of artefact sets are viable on Xinyan as a Main DPS, and her most recommended set can depend on each scenario. However the general 2 Bloodstained + 2 Pale Flame has great consistency. \n*Xinyan does not need to have the standard 1:2 CRIT ratio from C2 upwards and can aim for a 1:3 ratio instead.* \n**Pyro Support**\n\n**Shield Bot**\nAs a Shield Bot Xinyan is extremely simple. Unleash her Elemental Skill and hit multiple enemies or use her Elemental Burst with C2 to gain a Level 3 shield.\n*Xinyan’s shield has “Levels” with different scalings and Level 3 providing a small amount of off-field pyro application and being the strongest. There are quite a few characters contending to be a shielder instead in her spot. While Thoma and Yanfei are fellow Pyro shielders (Thoma having one of the strongest shields at max stacks but with greater energy issues and Yanfei being able to hold Prototype Amber and become a pseudo healer or buff with the Thrilling Tales of the Dragon Slayers but being constellation locked), Xinyan generally contends with Diona and Zhongli instead. This is due to her 4th ascension passive buffing Physical damage for those in her shield. She has a disadvantage to Diona (as she is Cryo for Physical Teams requiring Superconduct and provides Elemental Mastery for reaction teams, works as a Cryo battery and stable user of the Favonius Warbow, and provides Movement Speed) but does have the Physical damage bonus. However, Zhongli exists with his universal resistance debuff.*\nLuckily, Xinyan is not a unit highly contended for. ",
    "title": "Xinyan | Playstyle"
}