{
    "footer": {
        "text": "Character Guide • Playstyle: Ganyu | Update Date: 08/05/2022 | Editor: LordOfEnnui#8710"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/2Tff8N2.png"
    },
    "color": 10147839,
    "type": "rich",
    "description": "Because of her 'repetitive' battle style of using her AOE Charged Attacks Blooms from a distance, Ganyu has received a lot of criticism. However, her playstyles are more flexible than this stereotype encompasses.\nHer Ice Lotus Elemental Skill functions as an AOE Taunt that lures enemies in and moves her backwards to gain distance. This Taunt is particularly powerful and can potentially allow Ganyu to execute a few Charged Attacks without being interrupted.\n\n**Melt On-field DPS**\nNot being interrupted is essential to play Melt Ganyu, but many Pyro Enablers are close range, like Xiangling’s Pyronado, Sunfire Jean or even Sucrose/Kazuha’s Pyro Absorbed Elemental Bursts - as moving away would mean sacrificing valuable DPS time. As such a Shielding Support can be invaluable. As additional Cryo applications can mess up her setups and remove Pyro Aura from the enemy, using her Elemental Burst is not recommended. When using Sucrose/Kazuha, Double Swirl setups are recommended, more information on rotations can be found in the KQM guide.\n\n**Freeze On-field DPS and Off-field Support**\nFreeze provides a lot of utility for Ganyu. The 4pc Blizzard Strayer Set bonus combined with her A1 Passive and Cryo Resonance provides 75% bonus CRIT Rate if the enemy is Frozen. Additionally, Freeze stops enemies in their tracks, which provides great defensive utility. Ganyu’s Elemental Burst is essential in these teams, as it provides her with large AOE Cryo Application and damage. She should attack within it to capitalize on the 20% Cryo DMG bonus it provides. Its damage is also very significant and makes Amos not as optimal in these teams. As a support, Ganyu is primarily used for her Elemental Burst’s Cryo application and Cryo DMG buff.\n\n**Combos and Tech**\nWhen using the Amos bow, you are guaranteed 3 stacks of Amos' passive on her blooms, which means Amos is viable in shotgun range as well; such as in most melt teams. For full stacks, a distance around half the length of her Elemental Burst is sufficient.\nThe ARCC cancel doesn’t work on Ganyu (except C6). However, another Combo does work:\n1. Charged Attack by holding attack\n2. Go into Aim mode, cancelling the end lag of the Charged Attack\n3. Charge Attack in Aim mode\n4. Dash out of Aim mode and repeat\nThis combo is far from necessary but can provide a way to get two Charged Shots off in quick succession. ",
    "title": "Ganyu | Playstyle"
}