{
    "footer": {
        "text": "Character Guide • Synergy: Eula"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/J4NNoqO.png"
    },
    "color": 10147839,
    "type": "rich",
    "description": "**Eula-Fischl Core** The original bread and butter Eula team comp. Most Eula teams that are easy and consistent to perform and play with decent quality of life rotations will follow this template. Fischl applies consistent, long-existing Superconduct, and other units keep Eula damage high and consistent, or provide her with defense. Except for Eula, all other units are usually 4*, even the optional ones making it very F2P friendly. Here are some popular variations of this template and how to play them. Do note these are suggestions, you can build different comps with this template once you understand more about how each unit performs in a Eula team setting.\n**Eula-Fischl: Triple Cryo** A popular variation that allows consistent energy regeneration for Eula. The damage ceiling of this team is not the highest, but it is consistent, and the barrier of entry is quite low. Recommended if you just started playing Eula.\n**Eula-Fischl Beidou Driver** The most mechanically intensive variation. Here you trade a bit of Eula’s damage to enable Beidou’s massive off-field damage. A very energy hungry variation, your Eula will need upwards of 170 ER% to burst off-cooldown efficiently. It is recommended to end fights in around 1-2 Burst rotations, otherwise you might run into energy issues. Hard to pilot well, prepare to put in practice time. The rewards are very worth it, as this comp scales very well with your Beidou’s investment.\n**Eula-Raiden Core** A more expensive version of Fischl variations, Raiden’s Elemental Skill is basically a better Fischl for Eula. It applies consistent Electro for Superconduct, and trades personal off-field damage for more damage on Bursts and Raiden’s on-field damage, which usually out-damages Fischl at the same investment. Raiden significantly reduces the whole team ER% requirement with her top-tier team-wide energy regeneration, making team building and investing a lot easier (note: Eula will still need a Cryo battery, even with Raiden). You trade all these benefits for a higher mechanical skill requirement, as both Eula and Raiden have quite complicated combos that need to be performed well to play efficiently. Eula-Raiden compositions always have rotation times over 22 seconds, and most can often approach 25+ seconds. Even though the damage per rotation is much higher than Eula Fischl’s, the DPS, although still higher, is not exceedingly high enough that it invalidates any non-Raiden Eula user. Coupled on that all Eula Raiden variations have much more complex and active rotations, and a lot of the damage gain actually comes from fine tuning your ER requirement and using those spare\n**Eula-Raiden: Zhongli-Rosaria** A standard team where you fill generalist units that can support both Eula and Raiden in dealing DPS. The rotation of this comp is quite snappy, fast, and easy to get used to. You can replace Rosaria for Diona if you are uncomfortable playing without a healer. Don’t use Zhongli Q outside of emergencies, it is always DPS loss.\n**Eula-Raiden: Beidou Driver** Same as Eula Fischl, this comp trades a lot of Eula’s personal damage to enable Beidou, and with Raiden’s Elemental Burst buffs, Beidou can dish out some serious damage here. Also same as Eula Fischl variation, this comp is now even harder to pilot well, although if you can play it perfectly, it is one of the highest damage Eula comp in 2-3 enemies scenarios, which is most often times when you want to use Eula anyways.",
    "title": "Eula | Team Composition and Synergy"
}