{
    "footer": {
        "text": "Character Guide • Synergy: Eula"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/J4NNoqO.png"
    },
    "fields": [
        {
            "inline": "false",
            "name": "Notes:",
            "value": "Electro flex options:\n\n1)Raiden is a strong second dps, she also boosts Eula's burst damage via her elemental skill and can battery the entire team\n\n2)Fischl is one of the best users of the tenacity of the millelith set, she also has great electro application to help Eula keep the superconduct reaction effect active\n\n3)Lisa has a very useful defense shred passive from her ascension 4 passive and as a catalyst user can hold the Thrilling Tales of Dragon Slayers catalyst to buff Eula's attack greatly. Do note that her energy requirements are **VERY** high, she usually wants 220+ er with zhongli and the cryo flex unit both holding favonius weapons\n\n4)Kuki Shinobu is also a unit that can use the tenacity of the millelith set and is a fairly capable healer. She also usually uses favonius sword and hence can be a great battery too \n\nCryo flex options:\n\n1)Rosaria generates a lot of particles on her skill, while also quickly dashing towards opponents. She is a great user of the favonius lance and the noblesse oblige set, additionally her C6 passive debuffs opponents and reduces their physical resistance by 20%. She also has a team crit rate boost ability, however this is inconsistent and should not be relied upon. If looking to make use of this crit rate boost ability it is recommended to change Eula's rotation to the following:\n> Eula tap skill\n> Rosaria skill, burst\n> Eula burst (then continue the rotation as normal)\n\n2)Shenhe's burst reduces opponent's cryo and physical resistance by upto 15%, and her press skill increases burst damage by 15%. While her hold skill increases normal attack damage, it is not recommended that you use the hold skill because of it's cooldown\n\n3)Kaeya generates roughly the same amount of particles as Rosaria and can hold a favonius weapon and the noblesse oblige set, however he doesn't have any additional benefits beyond this without his C2 and C6, both of which potentially increase his off field damage.\n\nAdditional notes:\n\n1)Yelan's ascension 4 passive is very useful for Eula, and since Eula has a strong interruption resistance during her burst, she can stay on Bennett's field of effect to maximize her damage.\n\n2)In the team Eula/Raiden/Lisa/Zhongli, Eula's energy requirements greatly increase due to the lack of a cryo battery. If playing this team, it is highly recommended to give Zhongli the favonius lance and also ensure that Raiden has 260er or more, while Eula has 140er or more "
        }
    ],
    "color": 10147839,
    "type": "rich",
    "description": "eula,electroflex,cryoflex,zhongli|eula,electroflex,cryoflex,bennett|eula,raiden,yelan,bennett|eula,raiden,lisa,zhongli|eula,fischl,diona,beidou",
    "title": "Eula | Team Composition and Synergy"
}