{
    "footer": {
        "text": "Character Guide • Constellations: Yaoyao"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Yaoyao.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Adeptus' Tutelage (C1)",
            "value": "When White Jade Radishes explode, active characters within their AoE will gain 15% Dendro DMG Bonus for 8s and have 15 Stamina restored to them. This form of Stamina Restoration can only be triggered every 5s."
        },
        {
            "inline": false,
            "name": "Innocent (C2)",
            "value": "While affected by the Adeptal Legacy state caused by Moonjade Descent, if White Jade Radish explosions damage opponents, 3 Energy will be restored to Yaoyao. This form of Energy regeneration can occur once every 0.8s."
        },
        {
            "inline": false,
            "name": "Loyal and Kind (C3)",
            "value": "Increases the Level of Raphanus Sky Cluster by 3.\nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Winsome (C4)",
            "value": "After using Raphanus Sky Cluster or Moonjade Descent, Yaoyao's Elemental Mastery will be increased based on 0.3% of her Max HP for 8s. The maximum Elemental Mastery she can gain this way is 120."
        },
        {
            "inline": false,
            "name": "Compassionate (C5)",
            "value": "Increases the Level of Moonjade Descent by 3.\nMaximum upgrade level is 15."
        },
        {
            "inline": false,
            "name": "Beneficent (C6)",
            "value": "For every 2 White Jade Radishes Yuegui: Throwing Mode throws out, the next throw will also release a Mega Radish that will have a larger AoE than the standard White Jade Radish and have the following effects upon exploding:\n• Deals AoE Dendro DMG based on 75% of Yaoyao's ATK.\n• Restores HP for the active character based on 7.5% of Yaoyao's Max HP.\n\nEvery Yuegei: Throwing Mode can throw out a maximum of 2 Mega Radishes."
        }
    ],
    "color": 6794623,
    "type": "rich",
    "title": "Yaoyao | Constellations"
}