{
    "footer": {
        "text": "Character Guide • Build: Ganyu | Update Date: 08/06/2022 | Editor: LordOfEnnui#8710"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/2Tff8N2.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Aqua Simulacra__\nBest damage focused weapon. Ganyu's Elemental Burst snapshots its 20% DMG bonus when near enemies, so ranged on-field DPS' are not a problem.\n\n__Elegy for the End__\nGreat for team compositions based on Reactions. Its Elemental Mastery and ATK% buffs are very helpful. The ER stat is great for her, as running ER sands may no longer be necessary in some teams. On others, it can be a loss for her personal DPS but is usually made up for by the gain in team DPS.\n\n__Favonius Warbow__\nConditionally very good; as Ganyu gets CRIT Rate from many sources, getting its passive off can be consistent depending on the team composition, decreasing ER requirements and thus increasing potential team DPS. Note that it only activates when she is on-field. "
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__Thundering Pulse__\nExcellent weapon for sub-DPS capability. Its passive is largely wasted due to it providing Normal Attack DMG.\n\n__Polar Star__\nConditionally excellent in comps that can fully or partially stack its passive by weaving a Charged Attack and/or a Normal Attack into Ganyu's rotation window (ie. N1CEQ) without it being a DPS loss. Will go over 100% CRIT Rate against Frozen enemies with 4pc Blizzard Strayer and Cryo Resonance, thus losing value.\n\n__Skyward Harp__\nGreat unconditional damage option. The CRIT Rate stat is not ideal, as it raises the likelihood that Ganyu goes over 100% CRIT Rate with artifact substats against frozen enemies.\n\n__Prototype Crescent R5__\nAssuming she can take the time to hit a weakpoint, this bow is competitive with her 5* bows.\n\nMounn’s Moon, The Viridescent Hunt, The Stringless, Alley Hunter, Blackcliff Warbow are all very viable. Most DPS bows can be viable in comps that use some Charged Attacks.\n"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-emblemofseveredfate"
        },
        {
            "inline": "false",
            "name": "Second Best Artifact Set:",
            "value": "x4-noblesseoblige"
        },
        {
            "inline": "false",
            "name": "Third Best Artifact Set:",
            "value": "x2-blizzardstrayer|x2-noblesseoblige"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands> ATK%/Energy Recharge |<goblet>  Cryo DMG Bonus |<circlet>  CRIT DMG / CRIT Rate"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "CRIT Rate | CRIT DMG | Energy Recharge | ATK%"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Burst: Celestial Shower\n**2)** Normal Attack: Liutian Archery\n**3)** Elemental Skill: Trail of the Qilin\n"
        }
    ],
    "color": 10147839,
    "type": "rich",
    "title": "Ganyu (Burst Support) | Build"
}