{
    "footer": {
        "text": "Character Guide • Playstyle: Lisa | Update Date: 09/21/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/a0E1K9o.png"
    },
    "color": 11104511,
    "type": "rich",
    "description": "**On-field Carry**\nDespite being free, Lisa’s got quite a few things in her kit. One of the best scaling on her Elemental Skill, universal utility on her Elemental Burst, highest charged attack multipliers, AOE and single target damage, etc. Unfortunately, she’s got long cooldowns, little to no interruption resistance but now has Aggravate with the introduction of Dendro. The general recommendation is to play her with a Hydro and/or Dendro unit for Aggravate, Electrocharged and/or Hyperbloom. Her constellations are quite strong, but hard to get. For optimal movement strings, follow the KQM Lisa guide.\n*This is not her best role, despite her kit suggesting so. Unless built as a hypercarry, she will act as a sub carry where she applies Conductive Stacks on as many enemies as she can and nuke them with her hold Elemental Skill.*\n**Burst DPS**\nAs the name implies, she’s there for her Elemental Burst. This build has a slight issue right from the start. Lisa in this playstyle __generates almost no particles__, leading her to either run a battery or sacrifice damage for the sake of meeting an extreme Energy requirement. If characters such as Raiden or Fischl are present, Lisa can build for more offensive stats. If not, players are recommended to focus on Energy and the other utility she has while giving up her personal damage with a Support build and playstyle.\n**EM Carry**\nLisa ascends with Elemental Mastery. Previous to the release of Dendro, Lisa’s EM Carry build focused around Overloads. However, with the new Aggravate reaction, Lisa will deal significant damage focusing on Elemental Mastery. If focusing on Overload, CRIT stats and combat talent levels can be ignored. A reliable off-field source of pyro such as Xiangling must be present, and a crowd control unit is highly recommended when facing enemies prone to knockback.\nIf focusing on Aggravate and her Electro damage, Elemental Mastery, Electro DMG Bonus%, CRIT stats and Energy Recharge must be all considered. The high investment the Aggravate EM carry build will result in generally more damage. Currently there are limited Dendro units, but Lisa with her universal Defence shred and on-field or off-field electro application makes her fairly synergetic with all.\n**Support**\nBeing a catalyst, Lisa is able to hold the Thrilling Tales of Dragon Slayers, proving a hefty attack buff the to the team’s main DPS. With her skill and burst being relatively simple to hit enemies with, Instructors, Deepwood Memories, Noblesse Oblige, Tenacity of the Millelith and Exile can be used on her. On top of being viable with these sets, Lisa provides a much-valued Defence shed. While others have their Defence ignoring or reducing talents locked behind constellations, Lisa not only has this as an ascension talent but is free herself.  Unlike the viridescent Venerer set or the Archaic Petra set, Defence reductions allow for Physical Carries, Dendro, Geo and Anemo characters to do extra damage.\n*Even if you choose to not use her in combat, she’s great at climbing.*",
    "title": "Lisa | Playstyle"
}