{
    "footer": {
        "text": "Character Guide • Playstyle: Anemo Traveler | Update Date: 09/28/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/B0zBZMi.png"
    },
    "color": 5494962,
    "type": "rich",
    "description": "**Support**\n*Note that Anemo Traveler can be played as a quick-swap DPS with their Elemental Skill and Burst, but this role doubles as the way to play Support Anemo Traveler optimally.*\nThe main support Anemo Traveler provides is Enemy Elemental Resistance reduction and Crowd Control. In some of the teams, Anemo Traveler may be a reverse crowd controller, picking up small enemies and running away with them. Unlike Ayaka’s Elemental Burst, World Bosses or larger enemies do not stop the tornado spawned, but a geo construct such as Zhongli’s pillar will. Their talents **DO NOT** scale with Elemental Mastery, but as their main damage will be from swirling, they can be built the same as other Anemo Swirl supports. \nThe Elemental Absorption order is different from characters such as Sayu, Kazuha, Venti or Sucrose and prioritizes Cryo. Their Constellation 6 is available free for all players reduces the Elemental Resistance of enemies by 20% (for absorbed enemies), as well as providing one of the few sources of Anemo Resistance reduction. \nIn most gameplay, the Anemo Traveler will Swirl the main DPS’s element, dealing damage, gathering energy, and reducing corresponding Elemental Resistance. Constellation 4 will reduce damage taken while holding their Elemental Skill. When against enemies that are unable to be picked up or playing with geo constructs the Elemental Burst is also used for more damage, Crowd Control and further corresponding Elemental Resistance.\n__The Elemental Burst is not cast when the enemies or team is non-synergetic with the Tornado.__\n**Early Game Support**\nAlmost all enemies met at the start of the game can be picked up by the Elemental Burst. Building for Elemental Mastery and 4-piece Viridescent Venerer is not expected, instead Instructor or The Exile if possible and as much Energy Recharge is recommended. (It is not too difficult to get Constellation 2 providing 16% extra Energy Recharge permanently)\n*WINDBLADEEEEEEEEEEEEEE* ",
    "title": "Traveler | Playstyle"
}