{
    "footer": {
        "text": "Character Guide • Skill Talents: Baizhu"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Baizhuer.png"
    },
    "color": 6794623,
    "type": "rich",
    "description": "**Normal Attack: The Classics of Acupuncture**\n*Normal Attack*\n> **Normal Attack:** Performs up to 4 attacks that deal Dendro DMG to opponents in front of him.  \n> **Charged Attack:** Consumes a certain amount of Stamina to deal AoE Dendro DMG to opponents in front of him after a short casting time.  \n> **Plunging Attack:** Calling upon the might of Dendro, Baizhu plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Dendro DMG upon impact with the ground.\n**Universal Diagnosis**\n*Elemental Skill*\nControls a Gossamer Sprite that cruises and attacks nearby opponents, dealing Dendro DMG.\nAfter it performs 3 attacks or if there are no opponents nearby, the Sprite will return, healing all nearby party members based on Baizhu's Max HP.\n\nThose in the medical field who can read true signs of illness from false ones may even cure people before any symptoms can show.\n**Holistic Revivification**\n*Elemental Burst*\nEnters the Pulsing Clarity state, creating a Seamless Shield that absorbs Dendro DMG with 250% effectiveness.\nWhile in this state, Baizhu will generate a new Seamless Shield every 2.5s.\n\nThe Seamless Shield will heal your own active character based on Baizhu's Max HP and attack opponents by unleashing Spiritveins, dealing Dendro DMG under the following circumstances:\n<:blurplejoinarrow:932413900073369621> When a character is under the protection of a Seamless Shield and a new Seamless Shield is generated.\n<:blurplejoinarrow:932413900073369621> When the Seamless Shield's effects expire, or when it is shattered.\n\nIf you can perceive the heavens and the earth, defend against malignant auras with the flow of qi, and keep your mind clear, surely nothing can hinder you.\n",
    "title": "Baizhu | Skill Talents"
}