{
    "footer": {
        "text": "Character Guide • Playstyle: Arlecchino | Update Date: 10/05/2025 | Editor: .m1zuneko"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Arlecchino.png"
    },
    "flags": 0,
    "color": 16733525,
    "type": "rich",
    "description": "Arlecchino is an ATK-scaling Pyro polearm on-field DPS who deals damage using her Normal Attacks, which are enhanced when she has Bond of Life (BoL). BoL is a mechanic added in Fontaine that prevents your active character from being healed and can be cleared by healing away the BoL amount. It functions as a \"reverse shield\" or a \"healing debt.\"\n\nArlecchino's kit revolves around gaining BoL through her Skill and using her Burst to heal herself and reset her Skill cooldown. The downside, however, is that she cannot make use of any healing provided by other party members.\n\nWhen Arlecchino uses her Skill, she applies Blood-Debt Directive to enemies, and a Charged Attack will absorb this in order to grant her BoL (65% per enemy, up to 145%). Her Ascension 1 Passive Talent lets this Blood-Debt Directive upgrade into a Blood-Debt Due after 5 seconds, which grants significantly more BoL (130%). This means it’s ideal to use her Skill first, then swap to your supports, and finally absorb the BoL by Charged Attacking once before Normal Attacking. This isn’t necessary when there are two or more enemies, but it can still be done anyway.\n\nWhile Arlecchino's Elemental Burst can heal her, it clears all of her BoL, leaving none left over for the next rotation. Starting your next rotation with BoL increases the damage dealt by Arlecchino, since her Normal Attacks deal more damage the more BoL she currently has. Her Burst does relatively little damage compared to her Normal Attacks (at C0) and has a very long animation, so ideally, you would avoid using her Burst.\n\nThis does not mean you should never Burst, since you can still use it as a panic button if you are low on HP — you can’t do any DPS when you’re dead. The ideal way to Burst on Arlecchino is to use your Skill, Burst, and then Skill again, since the cooldown resets. This grants more healing and particles. This is optional, and she can still heal without using her Skill as long as she has some BoL.\n\nArlecchino is a very strong and simple unit to play. All she needs is enough BoL, and you can spam Normal Attacks until your enemies are either dead or your Skill cooldown is over. Since her Normal Attacks don’t require any specific combos to be played optimally, you can dash as much as you need to in order to avoid taking damage.",
    "title": "Arlecchino | Playstyle"
}