{
    "footer": {
        "text": "Character Guide • Build: Yanfei | Update Date: 08/26/2022 | Editor: Luno#1337"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/AK3r6mb.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Sacrificial Fragments__\nStrongest option for Yanfei’s personal damage owing to a high EM substat. Spacing out of skill uses when the weapon passive procs is advised in order for electro auras to be maintained.\n\n__Thrilling Tales of Dragon Slayers__\nProvides a potent buff to a single party member, but mandates a structured rotation in order to properly pass the TTDS buff to the character who benefits most from it.\n** **"
        },
        {
            "inline": "true",
            "name": "Replacement Weapon:",
            "value": "__Magic Guide__\nInexpensive variant of sacrificial fragments but with slightly less damage potential.\n\n__Hakushin Ring__\nHakushin Ring’s weapon passive is extremely easy both to proc and maintain as Yanfei claims ownership over most, if not all overloads. Great multi-buffing qualities coupled with more flexible rotations makes this weapon comparable to the buff of Thrilling Tales of Dragon Slayers. \n\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-crimsonwitchofflames"
        },
        {
            "inline": "false",
            "name": "Second Best Artifact Set:",
            "value": "x4-thunderingfury"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "Elemental Mastery |Elemental Mastery |Elemental Mastery"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "Elemental Mastery |**__Avoid CRIT Rate substats__**"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "Talents need not be levelled in this playstyle "
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "CRIT Rate substats are to be voided in this playstyle due to her A4 applying more instances of pyro application which, although good in-theory, is not actually beneficial. This is in light of the extra pyro application instance messing up the auras on the enemy; resulting in less overloads owned by Yanfei.\n\nShould players have neither of the 4-piece artifact sets that boost her overload damage, running +80 EM 2-piece sets is an option.\nWhen opting for instructors as one of said +80 EM sets, it is recommended to only run the set piece on the flower and feather. "
        }
    ],
    "color": 16733525,
    "type": "rich",
    "title": "Yanfei (On-Field Overload DPS) | Build"
}