{
    "footer": {
        "text": "Character Guide • Skill Talents: Thoma"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/Tr5VWv6.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Swiftshatter Spear",
            "value": "*Normal Attack*\n> > **Normal Attack:** Performs up to four consecutive spear strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Blazing Blessing",
            "value": "*Elemental Skill*\n> Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals AoE Pyro DMG, while also summoning a defensive Blazing Barrier.\nAt the moment of casting, Thoma's Elemental Skill applies Pyro to himself.\nThe DMG Absorption of the Blazing Barrier scales off Thoma's Max HP.\nThe Blazing Barrier has the following traits:\n- Absorbs Pyro DMG 250% more effectively.\n- When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\nThe maximum DMG Absoprtion of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP."
        },
        {
            "inline": false,
            "name": "Crimson Ooyoroi",
            "value": "*Elemental Burst*\n> Thoma spins his polearm, slicing at his foes with roaring flames that deal AoE Pyro DMG and weave themselves into a Scorching Ooyoroi.\nScorching Ooyoroi\nWhile Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing AoE Pyro DMG and summoning a Blazing Barrier.\nFiery Collapse can be triggered once every 1s.\nExcept for the amount of DMG they can absorb, the Blazing Barriers created in this way are identical to those created by Thoma's Elemental Skill, Blazing Blessing:\n- Absorbs Pyro DMG 250% more effectively.\n- When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed.\nThe maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.\nIf Thoma falls, the effects of Scorching Ooyoroi will be cleared."
        }
    ],
    "color": 16733525,
    "type": "rich",
    "title": "Thoma | Skill Talents"
}