{
    "footer": {
        "text": "Character Guide • Build: Kamisato Ayato | Update Date: 08/23/2022 | Editor: Luno#1337"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/aIcY8dQ.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Haran Geppaku Futsu, Primordial Jade Cutter__\nAyato’s strongest weapon options that are generally performs similarly overall. Thus, it is not recommended to pull for Haran should player’s have the Primordial Jade Cutter and likewise.\n\n__The Black Sword__\n4 star Best-in-Slot weapon with its stat spread and passive being largely beneficial to Ayato’s kit. However, it should be noted that the weapon does not scale all that well with refines, thus purchasing multiple battlepasses to refine the weapon is not advisable.\n\n__Lions Roar__\nObtainable via gacha, Lions Roar is a strong weapon as Ayato’s predominant teams are electrocharge and soup; both of which can keep consistently high uptime on the passive of Lions Roar.\n** **"
        },
        {
            "inline": "true",
            "name": "Replacement Weapon(s):",
            "value": "\n__Mistsplitter’s Reforged__\nA minor improvement over Ayato’s 4 star weapon options as he will rarely be able to maintain and utilize its passive to the fullest extent. Although perfectly usable, it is much preferred to use the weapon on other characters who would gain more benefit using the weapon than Ayato would.\n\n__Cursed Blade__\nA F2P friendly and decent weapon option should players not have any of the weapons mentioned above.\n\n__Amenoma Kageuchi__\nAyato usually casts his burst at the start of the rotation, rendering the energy gained from the weapon passive near-useless. Thus, players will still need to build the same amount of ER as they did with any other weapon to be able to burst on the subsequent rotations.\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "x4-gladiatorsfinale"
        },
        {
            "inline": "false",
            "name": "Second Best Artifact Set:",
            "value": "x4-heartofdepth"
        },
        {
            "inline": "false",
            "name": "Third Best Artifact Set:",
            "value": "x4-echoesofanoffering"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "<sands>  ATK% | <goblet>  Hydro DMG Bonus | <circlet>  CRIT DMG or CRIT Rate"
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "Energy Recharge to 140% (check guide for ER table)|CRIT Rate|CRIT DMG|ATK%"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Skill: Kamisato Art- Kyouka\n**2)** Elemental Burst: Kamisato Art- Suiyuu\nThere is **__No Need__** to level his normal attack talent as his Auto Attacks in his Elemental Skill state has a different set of multipliers based on his **__Elemental Skill.__**\n** **"
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "The difference between Gladiator’s Finale and Heart of Depth comes down to the substat differences and the team buffs present.\n\nA 4 set of Echoes of an Offering should only be considered when ping is consistently below 100, where the artifact set will be accordant with the other options. Otherwise, it is better to farm for 4 Heart of Depth as the artifact passive is essentially unconditional while simultaneously being able to farm for Blizzard Strayer pieces — another common artifact set utilized by many cryo characters."
        }
    ],
    "color": 3245055,
    "type": "rich",
    "title": "Kamisato Ayato (On-Field DPS) | Build"
}