{
    "footer": {
        "text": "Character Guide • Build: Kamisato Ayato | Update Date: 08/06/2022 | Editor: Luno#1337"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/aIcY8dQ.png"
    },
    "fields": [
        {
            "inline": "true",
            "name": "Best Weapon(s):",
            "value": "__Primordial Jade Cutter__\nBest weapon for his personal damage as a Burst damage dealer. However in freeze comps, when opting to run 4 Blizzard, Ayato will very easily overcap on crit rate. In such a situation, it would be better to run an alternative weapon instead.\n\n__Favonius Sword__\nOwing to Ayato’s extraordinarily high ER requirments in this playstyle, Favonius sword is a strong weapon to manage his ER requirements, as well as the added utility of Favonius triggers lowering team ER requirements.\n\n__Mistsplitter’s Reforged__\nAnother personal damage focused weapon that does not run into issues in freeze team comps.\n\n__Skyward Blade__\nA more offense-oriented weapon compared to Favonius Sword with a large ER stat that is very appreciated in this playstyle to keep his ER requirements in-check.\n\n__The Black Sword__\nGeneral weapon option that still persists even in this playstyle. However, it runs into the same issue as Primordial Jade Cutter in overcapping crit rate when running 4 Blizzard.\n** **"
        },
        {
            "inline": "false",
            "name": "Best Artifact Set:",
            "value": "4x-emblemofseveredfate"
        },
        {
            "inline": "false",
            "name": "Second Best Artifact Set:",
            "value": "4x-blizzardstrayer"
        },
        {
            "inline": "false",
            "name": "Third Best Artifact Set:",
            "value": "4x-noblesseoblige"
        },
        {
            "inline": "true",
            "name": "Main Stats Priority",
            "value": "ATK% OR Energy Recharge |Hydro DMG Bonus |CRIT Rate or DMG "
        },
        {
            "inline": "true",
            "name": "Substats Priority",
            "value": "200%+ Energy Recharge (Check with the ERC for more specific requirements)|CRIT Rate |CRIT DMG |ATK%"
        },
        {
            "inline": "false",
            "name": "Talent Priority",
            "value": "**1)** Elemental Burst: Kamisato Art- Suiyuu\n**2)** Elemental Skill: Kamisato Art- Kyouka\nThere is **__No Need__** to level his normal attack talent as his Auto Attacks in his Elemental Skill state has a different set of multipliers based on his **__Elemental Skill.__**\n** **"
        },
        {
            "inline": "false",
            "name": "Notes:",
            "value": "ER is Important on Ayato in this playstyle. Thus an ER sands, although sacrificing much personal damage, would be more optimal in the long run as he is primarily in the team for his Off-Field hydro application.\n\nWhen running Ayato in a freeze team, 4 blizzard is his technical-best artifact set. However, should players not have enough blizzard pieces, priority of who gets the Blizzard pieces goes to the Cryo DPS while Ayato opts to run 4 Emblem of Severed Fate instead.\nIn teams where there are no 4 Noblesse Oblige holders, Ayato can sacrifice some of his personal damage to hold the 4 set and buff his teammates instead.\n"
        }
    ],
    "color": 3245055,
    "type": "rich",
    "title": "Kamisato Ayato (Burst/Freeze) | Build"
}