{
    "footer": {
        "text": "Character Guide • Playstyle: Mona | Update Date: 01/26/2023 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://gi.yatta.moe/assets/UI/UI_AvatarIcon_Mona.png"
    },
    "flags": 0,
    "color": 3245055,
    "type": "rich",
    "description": "**Burst Support**\nMona’s Elemental Burst applies a state called ‘Omen’, where small enemies are completely unable to move and all enemies take increased damage. The duration is short, and is generally utilized for Nukes, main DPSes with short DPS windows and Freeze teams. \nThis will focus more on general Freeze teams than Nukes and Hyper-carries that can clear content before the duration of Omen expires which tend to be whale and speedrunner territory.\nIn Freeze teams, Mona uses both her Elemental Skill and Burst for Hydro application and will have much higher Energy Requirements as she stays mainly off-field. Generally paired with characters such as Ayaka or Ganyu, Freezing Mona’s ‘bubble’ and extending the duration. This team works much more effectively against groups of small enemies, providing particle to lower energy requirements, being able to be immobilized and Frozen, etc. On the other hand, it’s not the best against World Bosses due to their inability to be Frozen.\n*For details on how Mona’s Omen duration extension works, check the linked KQM guide!*\n**Nuke**\nMona’s Elemental Burst has one of the highest scalings in the game, as well as being Hydro, allowing for a x2 multiplier through Vaporize. For an ideal Nuke, Mona should be paired with Bennett. Unlike most Nuke setup teams, Mona’s Burst can be reliably used, with her benefitting from having Energy Recharge. (4th Ascension passive)\nApply Hydro with any other part of her kit, Swirl for the Anemo unit’s buffs, apply Pyro (Bennett’s Elemental Burst is most recommended for the ATK% buff), Cast Mona’s Elemental Burst, triggering Vaporize that does NOT deal damage, wait 2 seconds then apply Pyro again to ‘pop’ the Illusory Bubble.\n*For detailed instructions, troubleshooting, explanations on why you need to wait 2 seconds and how this works, check the KQM guide linked below.*  \n**On-field DPS**\nRelies on the ability to constantly Vaporize, stacking all buffs for herself. After batterying Xiangling with Bennett and Swirling both elements with your Anemo support, she can use her Elemental Skill and Normal Attacks to deal high consistent damage. \nIt is up to the player to pick if they want to use the Nuke setup explained above as a part of their combos.\nHere, the player must also choose if they want to maximize Xiangling’s damage by applying as much Hydro as possible or focus on Mona’s damage by timing her Charged attacks to Vaporize from Xiangling’s Pyronado. \nNote that her Constellation 2 and 6 may change her combos, but not that drastically. For further information check the KQM guide linked below.\n*Why are even Normal Attack strings gatcha…*",
    "title": "Mona | Playstyle"
}