{
    "footer": {
        "text": "Character Guide • Skill Talents: Candace"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/iUCbIjQ.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Gleaming Spear - Guardian Stance",
            "value": "*Normal Attack*\n> **Normal Attack:** Performs up to four consecutive spear strikes.\n> **Charged attack:** Consumes a certain amount of Stamina to lunge forward, dealing damage to opponents along the way.\nAt end of the sequence, perform a more powerful slash.\n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact."
        },
        {
            "inline": false,
            "name": "Sacred Rite: Heron's Sanctum",
            "value": "Candace's fighting style is capable of warding of an entire tide of foes. \n'Tap'\n> Rushes forward with her shield, dealing Hydro DMG. \n'Hold' \n> Raises her shield to block incoming attacks from nearby opponents, forming a barrier that absorbs DMG based on her Max HP and absorbs Hydro DMG 250% more effectively. This barrier lasts until the Elemental Skill is unleashed. \nAfter holding for a certain period of time, Candace will finish charging, and when the skill button is released, the skill duration expires, or when the barrier is broken, she will perform a leaping strike that deals Hydro DMG to opponents in front of her."
        },
        {
            "inline": false,
            "name": "Sacred Rite: Wagtail's Tide",
            "value": "Raising her weapon on high, Candace calls upon a divine blessing that deals AoE Hydro DMG based on her Max HP and continuously confers the Prayer of the Crimson Crown on your active character. \nPrayer of the Crimson Crown \nThis effect has the following properties:\n>·Characters deal increased Elemental DMG with their Normal Attacks. \n·Whenever a character takes the field, they will unleash a rippling wave of water that deals Hydro DMG to nearby opponents. There is a limited number of waves that can be triggered in the duration of this skill. \n·Sword, Claymore, and Polearm-wielding character(s) under this effect will obtain a Hydro Infusion.\nThis secret rite has been passed down through Candace's clan from generation to generation. Though the old faiths have become lost over the years, the sands still protect the heirs of the ancient realm."
        },
     
    ],
    "color": 3245055,
    "type": "rich",
    "title": "Candace | Skill Talents"
}
