{
    "footer": {
        "text": "Character Guide • Skill Talents: Nilou"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Nilou.png"
    },
    "color": 3245055,
    "type": "rich",
    "description": "**Normal Attack: Dance of Samser**\n*Normal Attack*\n> **Normal Attack:** Performs up to 3 consecutive sword strikes.  \n> **Charged Attack:** Consumes a certain amount of Stamina to perform a twirling slash.  \n> **Plunging Attack:** Plunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n**Dance of Haftkarsvar**\n*Elemental Skill*\nEnters the Pirouette state, dealing Hydro DMG to nearby opponents based on Nilou's Max HP.\nWhile she is in the Pirouette state, Nilou's Normal Attacks and Elemental Skill will cause her to enter the Sword Dance and Whirling Steps stances respectively, causing DMG she deals to be converted to Hydro DMG that cannot be overridden and that is considered Elemental Skill DMG.\n\nIn these stances, Nilou's third dance step will end Pirouette, and has the following effects based on the type of said dance step:\n<:blurplejoinarrow:932413900073369621> Sword Dance: unleashes a Luminous Illusion that deals Hydro DMG to opponents it touches and grants Nilou the Lunar Prayer effect. This effect converts Nilou's Normal Attacks into Sword Dance techniques, and her final hit will unleash a Luminous Illusion.\n<:blurplejoinarrow:932413900073369621> Whirling Steps: Nilou unleashes a Whirling Water Wheel that deals AoE Hydro DMG and creates a Tranquility Aura that follows your active character around and applies Wet to opponents within its AoE.\n\nNilou is unable to perform Charged Attacks when under the effect of Pirouette or Lunar Prayer. These effects will be removed once she leaves the field.\n\n\"Daintily her toes touch the water's face, and the light that ripples forth equals even the seven heavens.\"\n**Dance of Abzendegi: Distant Dreams, Listening Spring**\n*Elemental Burst*\nBegins the dance of faraway dreams and springs that hear, causing a Lotus of Distant Waters to bloom, dealing AoE Hydro DMG based on Nilou's Max HP and applying the Lingering Aeon effect to all opponents hit.\nAfter an interval, opponents affected by Lingering Aeon will take Hydro DMG.\n\n\"We have never witnessed that distant dream, but this dance can bring it to life.\"\n",
    "title": "Nilou | Skill Talents"
}