{
    "footer": {
        "text": "Character Guide • Playstyle: Xiao | Update Date: 08/05/2022 | Editor: LordOfEnnui#8710"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/uSkv5pg.png"
    },
    "color": 5494962,
    "type": "rich",
    "description": "Xiao's playstyle relies on dealing AoE Anemo DMG through his plunge attacks. His Elemental Skill, Lemniscatic Wind Cycling, comes with two charges and allows Xiao to dash ahead while dealing Anemo DMG to foes in his path.\n\n**Energy Management**\nAbsolutely essential to effectively use Xiao, as he doesn’t generate any particles from his Elemental Skill while his Elemental Burst is active, and selfishly takes up field time. Particle Funneling is a common tech prescribed to remedy this:\n> 1. Use an Anemo Battery’s Elemental Skill\n> 2. Swap to Xiao and use his Elemental Skill twice\n> 3. Burst on Xiao\nThis needs to be executed fast (you’ll need good ping for the Step 1-2 character swap), as the particles should not reach Xiao while his energy is full. There’s a further complication: There is about a half second delay between casting his Elemental Burst, and his energy being drained. This delay exists to some degree on all characters but can create inconsistency in Xiao’s energy. There are Advanced Techs to remedy this by spawning Particles away from Xiao, but it may be more reliable to spend some time post rotation Batterying him, running more ER on him, using Favonius weapons on Supports or running sub-DPS Raiden Shogun – though this tech is usually still helpful.\n\n**Plunge Tech**\nXiao has increased knockback in his Elemental Burst state. On one hand, this keeps enemies staggered. On the other, it knocks them out of his AOE. To work around this, try to knock enemies back in the same direction by plunging on one side of a group of enemies. This can actually group them against a wall, where you can then go ham.\n\nXiao’s best attack style is almost always High Plunge. Normal Attack Talent sections detail three numbers:\n- ***Plunge*** damage, which is dealt when a plunging character model actually hits an enemy\n- ***Low Plunge*** damage and ***High Plunge*** damage, which are dealt in an AOE based on the height of the character before plunging\nTry to plunge high enough that you deal High Plunge damage but not so high that you lose DPS, and spam High Plunges in all multitarget scenarios.\n\nIn single target scenarios, you can use the JET combo: N1CJP, or a Charged Attack cancelled with a Jump followed by a High Plunge. Further, hitting Xiao’s character model into the enemy will add a second damage instance per High Plunge (the ***Plunge*** damage – I know this is confusing). Some enemies can’t be hit by Plunge damage at all, and some can but only when Low Plunging. Please check the KQM guide for more info. ",
    "title": "Xiao | Playstyle"
}