{
    "footer": {
        "text": "Character Guide • Skill Talents: Sayu"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/oYiMaic.png"
    },
    "description" : "**Shuumatsuban Ninja Blade**\n*Normal Attack*\n> Normal Attack:\nPerforms up to 4 consecutive strikes.\nCharged Attack:\nrains Stamina over time to perform continuous spinning attacks against all nearby opponents. At the end of the sequence, perform a more powerful slash.\nPlunging Attack:\nPlunges from mid-air to strike the ground below, damaging opponents along the path and dealing AoE DMG upon impact.\n**Yoohoo Art: Fuuin Dash**\n*Elemental Skill*\nThe special technique of the Yoohoo Ninja Arts!\nSayu curls up into a rolling Fuufuu Windwheel and smashes into opponents at high speed, dealing Anemo DMG.\nWhen the duration ends, she unleashes a Fuufuu Whirlwind Kick, dealing AoE Anemo DMG.\nPress: Enters the Fuufuu Windwheel state, rolling forward a short distance before using the Fuufuu Whirlwind Kick.\nHold: Rolls about continuously in the Fuufuu Windwheel state, increasing Sayu's resistance to interruption while within that state.\nDuring this time, Sayu can control the direction of her roll, and can use the skill again to end her Windwheel state early and unleash a stronger version of the Fuufuu Whirlwind Kick.\nThe Hold version of this skill can trigger Elemental Absorption.\nThis skill has a maximum duration of 10s and enters CD once its effects end. The longer Sayu remains in her Windwheel state, the longer the CD.\nElemental Absorption: If Sayu comes into contact with Hydro, Pyro, Cryo and Electro while in her Windwheel state, she will deal additional elemental DMG of that type.\nElemental Absorption may only occur once per use of this skill.\n**Yoohoo Art: Mujina Flurry**\n*Elemental Burst*\nThe other super special technique of the Yoohoo Ninja Arts!\n\nIt summons a pair of helping hands for Sayu.\nDeals Anemo DMG to nearby opponents and heals all nearby party members. The amount of HP restored is based on Sayu's ATK. This skill then summons a Muji-Muji Daruma.\n\nMuji-Muji Daruma: At specific intervals, the Daruma will take one of several actions based on the situation around it:\nIf the HP of nearby characters is above 70%, it will attack a nearby opponent, dealing Anemo DMG.\nIf there are active characters with 70% or less HP nearby, it will heal the active character with the lowest percentage HP left.\n\nIf there are no opponents nearby, it will heal active characters nearby even if they have 70% HP or more.",
    "color": 5494962,
    "type": "rich",
    "title": "Sayu | Skill Talents"
}