{
    "footer": {
        "text": "Character Guide • Skill Talents: Wanderer"
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Wanderer.png"
    },
    "fields": [
        {
            "inline": false,
            "name": "Yuuban Meigen",
            "value": "*Normal Attack*\n> **Normal Attack:** Performs up to 3 attacks using wind blades, dealing Anemo DMG.\n> **Charged attack:** Consumes a certain amount of Stamina, gathers a build up of high wind pressure, and deals AoE Anemo DMG after a short casting time.\n> **Plunging Attack:** Calling upon the power of Anemo, The Wanderer plunges towards the ground from mid-air, damaging all opponents in his path. Deals AoE Anemo DMG upon impact with the ground."
        },
        {
            "inline": false,
            "name": "Hanega: Song of the Wind",
            "value": "*Elemental Skill*\n Concentrates the power of the winds to break free from the shackles of the earth, dealing AoE Anemo DMG before leaping into the air and entering the Windfavored state. \n**Windfavored** \nThe Wanderer enters a persistent hovering state, with increased Normal and Charged Attack AoE and DMG. Charged Attacks no longer consume Stamina. While this state is active, The Wanderer's movements gain the following properties: \n>·Persistently consumes Sky-Dweller Points to maintain this hovering state. \n>·When sprinting, additional Sky-Dweller Points will be consumed for The Wanderer to sprint mid-air. Holding sprint will cause persistent Sky-Dweller Point consumption to maintain speed.\n>·Jumping expends extra Sky-Dweller Points to increase hovering height. Holding jump will cause persistent Sky-Dweller Point consumption to keep increasing hovering height. \nRunning out of Sky-Dweller Points will end the Windfavored state. \nA second cast during the duration of Windfavored will also end it."
        },
        {
            "inline": false,
            "name": "Kyougen: Five Ceremonial Plays",
            "value": "*Elemental Burst*\nCompresses the atmosphere into a singular vacuum that grinds all troubles away, dealing multiple instances of AoE Anemo DMG. \nIf character is in the Windfavored state due to the skill Hanega: Song of the Wind, Windfavored state will end after casting."
        }
    ],
    "color": 5494962,
    "type": "rich",
    "title": "Wanderer | Skill Talents"
}
