{
    "footer": {
        "text": "Character Guide • Playstyle: Amber | Update Date: 08/25/2022 | Editor: Samantha#9907"
    },
    "thumbnail": {
        "url": "https://i.imgur.com/P3EU7xA.png"
    },
    "color": 16733525,
    "type": "rich",
    "description": "**Melt DPS**\nProbably Amber’s most straightforward and easy playstyle, Melt Amber revolves around Melting her charged attacks. Amber has a considerably high single-target damage celling even compared to 5-star units. There are three things required in this playstyle. Sufficient shielding or dodging to charge up a shot (taking around 1.5 seconds), off-field Cryo application and enough skill to consistently pull off headshots (hitting weak points of certain enemies).\nShielding or dodging can be mitigated slightly by her Elemental Skill, Explosive Puppet. More commonly known as Baron Bunny, the summoned doll will taunt nearby enemies, allowing Amber to charge up her shots without interruption. Amber’s constellation 2 will allow for her to manually detonate the bunny with a charged shot, dealing increased damage. However, if the Cryo application is too slow, her Baron Bunny may melt and take the aura away.\nAmber’s talents and passives to revolve around her Normal Attack, and players are greatly awarded for landing weakpoint hits while playing Amber. Weakpoints, such as ruin guard eyes or heads of humanoid enemies, are guaranteed Crit hits. This means that a skilled Melt Amber player will be able to hyper invest into Crit Damage instead. \n**Physical DPS**\nAmber mains will often choose this build while using her solo for the high DPS, consistency and flexibility of the build. This build requires a little bit more skill than other builds, generally needing to learn aim-cancel and dodging/aiming simultaneously. The aim-cancel can be done manually but is mechanically challenging after prolonged periods of time. A keyboard macro is recommended, and it is even more difficult on other platforms. However, she does not scale too poorly without these optimizations.\nInterruption is less important for this Amber build, but *generally characters that are alive do more damage than dead ones*. However, shielders and healers are always welcome.\n**Support**\nA little bit niche but mentionable regardless, Amber’s burst fulfils a lot of utility. C6 raises Attack and Movement Speed. It applies Pyro fast and enough times to not only trigger the Elegy for the End passive but is the only ability able to double Vaporize Xingqiu’s Elemental Skill.\nThe Pyro application can be helpful in the setup of a Hu Tao team and rapid shield breaks.\nFurthermore, she provides a small taunt and generalized buffs from artifacts and other weapons.\n**Early Game Amber**\nAmber’s charged shots in early game will generally be able to one-shot most overworld enemies even without Cryo. However, her fellow starter character Kaeya will be able to provide a high rate of (albeit close) Cryo application. ",
    "title": "Amber | Playstyle"
}