{
    "footer": {
        "text": "Character Guide • Playstyle: Emilie | Update Date: 01/29/2025 | Editor: ._.samantha._."
    },
    "thumbnail": {
        "url": "https://api.ambr.top/assets/UI/UI_AvatarIcon_Emilie.png"
    },
    "color": 6794623,
    "type": "rich",
    "description": "Since Emilie’s Skill, A1 Passive, and Burst allow her to deal damage from off-field, Emilie is often best as a sub-DPS that focuses on dealing powerful instances of Dendro damage while off-field.\n\nDue to her Skill and Ascension Passives having mechanics that rely on the Burning reaction, she heavily wants Pyro characters in her teams.\nIt's worth noting that due to Emilie not having the most off-field Dendro application, this can hinder her in teams outside of Burning (e.g., Quicken, Bloom). You can play her in these teams, but she is not particularly impressive in this role compared to her Burning teams.\n\nAlthough her kit relies so heavily on Burning, the DPS output that she provides with a constant Burning uptime is no joke.\nEmilie’s Skill deploys a Lumidouce Case that consistently attacks enemies within a large AoE. While the Lumidouce Case is active, enemies affected by Burning periodically drop “Scents” that can be picked up by the Lumidouce Case. After picking up 2 Scents, her Skill levels up and launches attacks that deal substantially more damage and has a larger AoE. If no Scents are picked up after 8s (i.e., if no Burning enemies are in range), the Lumidouce Case returns to its basic form. Because of this mechanic, Emilie wants enemies to be affected by Burning so that she can maintain her much-stronger Level 2 Skill. Since the Skill has a long 22s duration compared to its 14s cooldown, it is easy to achieve permanent uptime on it. However, do note that casting Emilie’s Skill resets her Lumidouce Case to Level 1, so avoid casting it too early as you are only able to have 1 Lumidouce Case at a time. In addition, Emilie’s Skill does not snapshot buffs, and it applies Dendro every other hit. Casting this Skill also launches a Pneuma-aligned Dendro attack.\n\nYou can use Emilie as an on-field DPS, but she does not deal significant damage with her Normal Attacks pre-C6. However, some teams give her more field time to take advantage of Bennett’s Flat ATK buff.",
    "title": "Emilie | Playstyle"
}